iPig/src/Reports/СписокФермыПоОпоросам/СписокФермыПоОпоросам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СписокФермыПоОпоросам</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

iPig/src/InformationRegisters/КарточкаСвиноматки/КарточкаСвиноматки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаСвиноматки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Падеж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кормилица</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоПотеряноКормодней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейДо1Осеменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАбортов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МертворожденныхНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятыхПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПадежДоОтъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СупоросныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодсосныхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыхДнейНаОпорос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОпоросовНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПустыеКормодни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтнятоПоросятНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЖиворожденныхНаСвиноматкуВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСлучка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХрякОсеменен</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУЗИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатУЗИ</name>
    <type>
      <types>EnumRef.РезультатУЗИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАборта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаАборт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МачехаОтъем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДо1Случки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПустыеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛактации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодсосныйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛевыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравыхСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияОтец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияМать</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.КритическиеДни</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пролечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Reports/СписокФермыПоОпоросам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПоОпоросамНаСервере()
	ДанныеРасшифровкиВ                      =Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета                       =Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                         =КомпоновщикМакета.Выполнить(Отчеты.ОтчетОДвижениюСырья.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"),Отчет.КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровкиВ);
	ПроцессорКомпоновки                     =Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровкиВ);
	ПроцессорВывода                         =Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	Результат.Очистить();
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.НачатьВывод();
КонецПроцедуры

&НаКлиенте
Процедура ПоОпоросам(Команда)
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
	ПоОпоросамНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок) 
	Макет = Отчеты.СписокФермыПоОпоросам.ПолучитьМакет("Макет");
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = Отчет.Дата;
	ТабДок.Вывести(ОбластьШапка);  
	ОбластьНеосемененные = Макет.ПолучитьОбласть("Неосемененные");
	ОбластьСвинки = Макет.ПолучитьОбласть("Свинки");
	ОбластьОдин = Макет.ПолучитьОбласть("Один");
	ОбластьДва = Макет.ПолучитьОбласть("Два");
	ОбластьТри = Макет.ПолучитьОбласть("Три");
	ОбластьЧетыре = Макет.ПолучитьОбласть("Четыре");
	ОбластьПять = Макет.ПолучитьОбласть("Пять"); 
	ОбластьШесть = Макет.ПолучитьОбласть("Шесть");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого"); 
	//ОбластьВозраст = Макет.ПолучитьОбласть("Возраст");
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналОтъемаСрезПоследних.Период КАК ДатаОтъема,
		|	ЖурналОпоросаСрезПоследних.Период КАК ДатаОпороса,
		|	ЖурналОсемененияСрезПоследних.Период КАК ДатаОсеменения,
		|	КарточкаСвиноматкиСрезПоследних.НомерОпороса КАК НомерОпороса,
		|	КарточкаСвиноматкиСрезПоследних.Период КАК ДатаВвода,
		|	КарточкаСвиноматкиСрезПоследних.КодПороды КАК КодПороды,
		|	АбортСрезПоследних.Период КАК ДатаАборта,
		|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного КАК НомерЖивотного
		|ИЗ
		|	РегистрСведений.КарточкаСвиноматки.СрезПоследних(&ДатаОтбора, ) КАК КарточкаСвиноматкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема.СрезПоследних КАК ЖурналОтъемаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОтъемаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОтъемаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения.СрезПоследних КАК ЖурналОсемененияСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОсемененияСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОсемененияСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОпороса.СрезПоследних КАК ЖурналОпоросаСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = ЖурналОпоросаСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = ЖурналОпоросаСрезПоследних.НомерОпороса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Аборт.СрезПоследних КАК АбортСрезПоследних
		|		ПО КарточкаСвиноматкиСрезПоследних.НомерЖивотного = АбортСрезПоследних.НомерЖивотного
		|			И КарточкаСвиноматкиСрезПоследних.НомерОпороса = АбортСрезПоследних.НомерОпороса
		|ГДЕ
		|	КарточкаСвиноматкиСрезПоследних.ДатаВыбытие = ДАТАВРЕМЯ(1, 1, 1)"; 
	Запрос.УстановитьПараметр("ДатаОтбора",Отчет.Дата);
		
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ИтогоКолНеосем = 0;  
	УУКолНеосем = 0;
	ПомесьКолНеосем = 0;
	ИтогоКолСвинки = 0;  
	УУКолСвинки = 0;
	ПомесьКолСвинки = 0;
	ИтогоКолОдин = 0;  
	УУКолОдин = 0;
	ПомесьКолОдин = 0;
	ИтогоКолДва = 0;  
	УУКолДва = 0;
	ПомесьКолДва = 0;
	ИтогоКолТри = 0;  
	УУКолТри = 0;
	ПомесьКолТри = 0;
	ИтогоКолЧетыре = 0;  
	УУКолЧетыре = 0;
	ПомесьКолЧетыре = 0;
	ИтогоКолПять = 0;  
	УУКолПять = 0;
	ПомесьКолПять = 0;
	ИтогоКолШесть = 0;  
	УУКолШесть = 0;
	ПомесьКолШесть = 0;
	КолИтого = 0;  
	УУКолИтого = 0;
	ПомесьКолИтого = 0;
    //ИтогоКолВозраст = 0;  
	//УУКолВозраст = 0;
	//ПомесьКолВозраст = 0;
	НомерОпороса = 0;
	КодПороды = Справочники.Порода.НайтиПоКоду("2");
	НомерЖивотного = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЖурналОсемененияСрезПоследних.НомерЖивотного КАК НомерЖивотного,
		//	|	ЖурналОсемененияСрезПоследних.НомерОпороса КАК НомерОпороса
		//	|ИЗ
		//	|	РегистрСведений.ЖурналОсеменения.СрезПоследних КАК ЖурналОсемененияСрезПоследних
		//	|ГДЕ
		//	|	ЖурналОсемененияСрезПоследних.НомерЖивотного = &НомерЖивотного
		//	|	И ЖурналОсемененияСрезПоследних.НомерОпороса = &НомерОпороса";
		//
		//Запрос.УстановитьПараметр("НомерЖивотного", ВыборкаДетальныеЗаписи.НомерЖивотного);
		//Запрос.УстановитьПараметр("НомерОпороса", ВыборкаДетальныеЗаписи.НомерОпороса);	
		//РезультатЗапроса = Запрос.Выполнить();	
		//Выборка = РезультатЗапроса.Выбрать();
		//n = 0;
		//Пока Выборка.Следующий() Цикл
		//	n = n+1;
		//КонецЦикла;
	    Если ВыборкаДетальныеЗаписи.НомерЖивотного <> НомерЖивотного Тогда
			Если ВыборкаДетальныеЗаписи.НомерОпороса = 0 Тогда
				НомерОпороса = ВыборкаДетальныеЗаписи.НомерОпороса;	
			ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОпороса) И ВыборкаДетальныеЗаписи.ДатаОпороса < Отчет.Дата Тогда
				НомерОпороса = ВыборкаДетальныеЗаписи.НомерОпороса;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаАборта) Тогда
				НомерОпороса = ВыборкаДетальныеЗаписи.НомерОпороса - 1;
			Иначе
				НомерОпороса = ВыборкаДетальныеЗаписи.НомерОпороса - 1;				
			КонецЕсли;	
			//Неосемененные 	
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОсеменения) И НомерОпороса = 0 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолНеосем = УУКолНеосем + 1;
				Иначе
					ПомесьКолНеосем = ПомесьКолНеосем + 1;
				КонецЕсли;
				ИтогоКолНеосем = ИтогоКолНеосем + 1;
			КонецЕсли; 
			//Свинки
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОсеменения) И НомерОпороса = 0 Тогда 
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолСвинки = УУКолСвинки + 1;
				Иначе
					ПомесьКолСвинки = ПомесьКолСвинки + 1;
				КонецЕсли;
				ИтогоКолСвинки = ИтогоКолСвинки + 1; 
			КонецЕсли;
			//Один 
			Если НомерОпороса = 1 Тогда
					Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
						УУКолОдин = УУКолОдин + 1;
					Иначе
						ПомесьКолОдин = ПомесьКолОдин + 1;
					КонецЕсли;
					ИтогоКолОдин = ИтогоКолОдин + 1; 
			КонецЕсли; 
	        //Два
			Если НомерОпороса = 2 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолДва = УУКолДва + 1;
				Иначе
					ПомесьКолДва = ПомесьКолДва + 1;
				КонецЕсли;
				ИтогоКолДва = ИтогоКолДва + 1; 
			КонецЕсли; 
			//Три
			Если НомерОпороса = 3 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолТри = УУКолТри + 1;
				Иначе
					ПомесьКолТри = ПомесьКолТри + 1;
				КонецЕсли;
				ИтогоКолТри = ИтогоКолТри + 1; 
			КонецЕсли; 
			//Четыре
			Если НомерОпороса = 4 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолЧетыре = УУКолЧетыре + 1;
				Иначе
					ПомесьКолЧетыре = ПомесьКолЧетыре + 1;
				КонецЕсли;
				ИтогоКолЧетыре = ИтогоКолЧетыре + 1; 
			КонецЕсли; 
			//Пять
			Если НомерОпороса = 5 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолПять = УУКолПять + 1;
				Иначе
					ПомесьКолПять = ПомесьКолПять + 1;
				КонецЕсли;
				ИтогоКолПять = ИтогоКолПять + 1; 
			КонецЕсли; 
			//Шесть
			Если НомерОпороса = 6 Тогда
				Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
					УУКолШесть = УУКолШесть + 1;
				Иначе
					ПомесьКолШесть = ПомесьКолШесть + 1;
				КонецЕсли;
				ИтогоКолШесть = ИтогоКолШесть + 1; 
			КонецЕсли; 
			//Итого
			Если ВыборкаДетальныеЗаписи.КодПороды = КодПороды Тогда
				УУКолИтого = УУКолИтого + 1;
			Иначе
				ПомесьКолИтого = ПомесьКолИтого + 1;
			КонецЕсли;
			КолИтого = КолИтого + 1;
		КонецЕсли;
		НомерЖивотного = ВыборкаДетальныеЗаписи.НомерЖивотного;
	КонецЦикла;
	//Неосемененные
	ОбластьНеосемененные.Параметры.ИтогоКолНеосем = ИтогоКолНеосем;
	ОбластьНеосемененные.Параметры.УУКолНеосем = УУКолНеосем;
	ОбластьНеосемененные.Параметры.ПомесьКолНеосем = ПомесьКолНеосем; 
	Если КолИтого > 0 Тогда
		ОбластьНеосемененные.Параметры.ИтогоПроцентНеосем = (ИтогоКолНеосем * 100)/КолИтого; 
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда
		ОбластьНеосемененные.Параметры.УУПроцентНеосем = (УУКолНеосем * 100)/УУКолИтого; 
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда
		ОбластьНеосемененные.Параметры.ПомесьПроцентНеосем = (ПомесьКолНеосем * 100)/ПомесьКолИтого;
	КонецЕсли;
    ТабДок.Вывести(ОбластьНеосемененные);
	//Свинки 
	ОбластьСвинки.Параметры.ИтогоКолСвинки = ИтогоКолСвинки;
	ОбластьСвинки.Параметры.УУКолСвинки = УУКолСвинки;
	ОбластьСвинки.Параметры.ПомесьКолСвинки = ПомесьКолСвинки;
	Если КолИтого > 0 Тогда
		ОбластьСвинки.Параметры.ИтогоПроцентСвинки = (ИтогоКолСвинки * 100)/КолИтого;
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда
		ОбластьСвинки.Параметры.УУПроцентСвинки = (УУКолСвинки * 100)/УУКолИтого; 
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьСвинки.Параметры.ПомесьПроцентСвинки = (ПомесьКолСвинки * 100)/ПомесьКолИтого; 
	КонецЕсли;	
    ТабДок.Вывести(ОбластьСвинки);
    //Один
	ОбластьОдин.Параметры.ИтогоКолОдин = ИтогоКолОдин;
	ОбластьОдин.Параметры.УУКолОдин = УУКолОдин;
	ОбластьОдин.Параметры.ПомесьКолОдин = ПомесьКолОдин;
	Если КолИтого > 0 Тогда
		ОбластьОдин.Параметры.ИтогоПроцентОдин = (ИтогоКолОдин * 100)/КолИтого;
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда
		ОбластьОдин.Параметры.УУПроцентОдин = (УУКолОдин * 100)/УУКолИтого;
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда
		ОбластьОдин.Параметры.ПомесьПроцентОдин = (ПомесьКолОдин * 100)/ПомесьКолИтого; 
	КонецЕсли;	
    ТабДок.Вывести(ОбластьОдин);
    //Два 
	ОбластьДва.Параметры.ИтогоКолДва = ИтогоКолДва;
	ОбластьДва.Параметры.УУКолДва = УУКолДва;
	ОбластьДва.Параметры.ПомесьКолДва = ПомесьКолДва;  
	Если КолИтого > 0 Тогда
		ОбластьДва.Параметры.ИтогоПроцентДва = (ИтогоКолДва * 100)/КолИтого; 
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда
  		ОбластьДва.Параметры.УУПроцентДва = (УУКолДва * 100)/УУКолИтого;  
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьДва.Параметры.ПомесьПроцентДва = (ПомесьКолДва * 100)/ПомесьКолИтого;  
	КонецЕсли;
    ТабДок.Вывести(ОбластьДва);
	//Три 
	ОбластьТри.Параметры.ИтогоКолТри = ИтогоКолТри;
	ОбластьТри.Параметры.УУКолТри = УУКолТри;
	ОбластьТри.Параметры.ПомесьКолТри = ПомесьКолТри; 
	Если КолИтого > 0 Тогда
		ОбластьТри.Параметры.ИтогоПроцентТри = (ИтогоКолТри * 100)/КолИтого; 
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда	
		ОбластьТри.Параметры.УУПроцентТри = (УУКолТри * 100)/УУКолИтого;
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьТри.Параметры.ПомесьПроцентТри = (ПомесьКолТри * 100)/ПомесьКолИтого;
	КонецЕсли; 	
    ТабДок.Вывести(ОбластьТри);
	//Четыре 
	ОбластьЧетыре.Параметры.ИтогоКолЧетыре = ИтогоКолЧетыре;
	ОбластьЧетыре.Параметры.УУКолЧетыре = УУКолЧетыре;
	ОбластьЧетыре.Параметры.ПомесьКолЧетыре = ПомесьКолЧетыре; 
	Если КолИтого > 0 Тогда 
		ОбластьЧетыре.Параметры.ИтогоПроцентЧетыре = (ИтогоКолЧетыре * 100)/КолИтого; 
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда	
		ОбластьЧетыре.Параметры.УУПроцентЧетыре = (УУКолЧетыре * 100)/УУКолИтого; 
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьЧетыре.Параметры.ПомесьПроцентЧетыре = (ПомесьКолЧетыре * 100)/ПомесьКолИтого; 
	КонецЕсли;	
    ТабДок.Вывести(ОбластьЧетыре);
	//Пять 
	ОбластьПять.Параметры.ИтогоКолПять = ИтогоКолПять;
	ОбластьПять.Параметры.УУКолПять = УУКолПять;
	ОбластьПять.Параметры.ПомесьКолПять = ПомесьКолПять;
	Если КолИтого > 0 Тогда
		ОбластьПять.Параметры.ИтогоПроцентПять = (ИтогоКолПять * 100)/КолИтого;
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда	
		ОбластьПять.Параметры.УУПроцентПять = (УУКолПять * 100)/УУКолИтого; 
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьПять.Параметры.ПомесьПроцентПять = (ПомесьКолПять * 100)/ПомесьКолИтого;
	КонецЕсли;	
    ТабДок.Вывести(ОбластьПять); 
	//Шесть
	Если ИтогоКолШесть <> 0 Тогда
		ОбластьШесть.Параметры.ИтогоКолШесть = ИтогоКолШесть;
		ОбластьШесть.Параметры.УУКолШесть = УУКолШесть;
		ОбластьШесть.Параметры.ПомесьКолШесть = ПомесьКолШесть;
		Если КолИтого > 0 Тогда
			ОбластьШесть.Параметры.ИтогоПроцентШесть = (ИтогоКолШесть * 100)/КолИтого;
		КонецЕсли;  
		Если УУКолИтого > 0 Тогда	
			ОбластьШесть.Параметры.УУПроцентШесть = (УУКолШесть * 100)/УУКолИтого; 
		КонецЕсли;
		Если ПомесьКолИтого > 0 Тогда	
			ОбластьШесть.Параметры.ПомесьПроцентШесть = (ПомесьКолШесть * 100)/ПомесьКолИтого;
		КонецЕсли;	
	    ТабДок.Вывести(ОбластьШесть);
	КонецЕсли;
  	//Итого 
	ОбластьИтого.Параметры.КолИтого = КолИтого;
	ОбластьИтого.Параметры.УУКолИтого = УУКолИтого;
	ОбластьИтого.Параметры.ПомесьКолИтого = ПомесьКолИтого;
	Если КолИтого > 0 Тогда
		ОбластьИтого.Параметры.ПроцентИтого = (КолИтого * 100)/КолИтого;
	КонецЕсли;  
	Если УУКолИтого > 0 Тогда	
		ОбластьИтого.Параметры.УУПроцентИтого = (УУКолИтого * 100)/КолИтого;
	КонецЕсли;
	Если ПомесьКолИтого > 0 Тогда	
		ОбластьИтого.Параметры.ПомесьПроцентИтого = (ПомесьКолИтого * 100)/КолИтого; 
	КонецЕсли;	
    ТабДок.Вывести(ОбластьИтого);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СформироватьНаСервере(ТабДок);
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.Показать();

КонецПроцедуры
